Tekla Open API Reference for Tekla Structures 2025
Grid.GetObjects Method
Overload List
Name | Description
GetObjects()
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid.
GetObjects(Type[])
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid that are of certain TypeFilter.
Top
See Also
Reference
Grid Class
Tekla.Structures.Drawing Namespace